
Процедура КнопкаВыполнитьНажатие(Кнопка)
		Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОперацияБух.Ссылка как ДокОперацияСсылка
	|ИЗ
	|	Документ.ОперацияБух КАК ОперацияБух
	|ГДЕ
	|	ОперацияБух.Содержание ПОДОБНО &Содержание
	|";
	
	
	Запрос.УстановитьПараметр("Содержание", "Купівля заборгованості згідно договору факторингу");
	
Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
Набор = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
      
    Набор.Отбор.Регистратор.Установить(Выборка.ДокОперацияСсылка);
    Набор.Прочитать();

    Для каждого Запись из Набор Цикл

     Если Запись.СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеТекущиеФинансовыеИнвестиции Тогда
      
	 Запись.СубконтоДт.Контрагенты = КонтрагентИзСвойствДоговора(Запись.СубконтоДт.Договоры);

     КонецЕСли;
    КонецЦикла;
      
	Набор.Записать(); 
	
	
		КонецЦикла;
		
		
КонецПроцедуры


Функция КонтрагентИзСвойствДоговора(Знач ДоговорКонтрагента )
	
	Перем РЗ, ТекстЗапроса;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектов.Значение Как Контрагент
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Объект = &ДоговорКонтрагента
	|";
	
	
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию( "Поставщик"));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.Текст = ТекстЗапроса;
	РЗ = Запрос.Выполнить().Выбрать();
	Пока РЗ.Следующий() Цикл
		Контрагент = РЗ.Контрагент;
	КонецЦикла;
    Возврат Контрагент;
КонецФункции
