Перем мВалютаРегламентированногоУчета Экспорт;


Функция Печать() Экспорт
	ПолучитьФорму("Форма").Открыть();
КонецФункции

// Функция формирует фамилию и инициалы либо по наименованию элемента спр-ка ФизическиеЛица 
// либо по переданным строкам. 
// Если передан Объект, то извлеченная из него строка считается совокупностью 
// Фамилия + Имя + Отчество, разделенными пробелами. 
// 
// Параметры 
// Объект	- строка или ссылка или объект элемента спр-ка ФизическиеЛица. 
// Фамилия	- фамилия физ. лица. 
// Имя	- имя физ. лица. 
// Отчество	- отчество физ. лица. 
// 
// Возвращаемое значение 
// Фамилия и Инициалы одной строкой. Побочные эффекты - переданная целая строка 
// Побочные эффекты - переданная целая строка разбивается на подстроки, соответствующие 
// отдельным Фамилии,Имени и Отчеству 
//
//Объект = "", Фамилия = " ", Имя = " ", Отчество = " "
//Если Не ЗначениеЗаполнено(Фамилия) И Не ЗначениеЗаполнено(Имя) Тогда 
//ФИО = ФамилияИмяОтчествоФизЛица(Объект); 
//Фамилия = ФИО.Фамилия; 
//Имя	= ФИО.Имя; 
//Отчество= ФИО.Отчество; 
//КонецЕсли;	
Функция ФамилияИнициалыФизЛица(ФИОСлитно) Экспорт
//	RTFM СтрЗаменить(ФИОСлитно,Пробел,Символы.ПС), СтрПолучитьСтроку(,),Лев(,)
//ФИОСлитно это Фамилия Имя Отчетсво 
Фамилия=СокрЛП(Лев(СокрЛП(ФИОСлитно),Найти(ФИОСлитно," "))); ///Находим фамилию 
ИмяОт=Прав(ФИОСлитно,СтрДлина(ФИОСлитно)-СтрДлина(СокрЛП(Фамилия))-1); //Получаем Имя и Отчетсво 
Имя=СокрЛП(Лев(СокрЛП(ИмяОт),Найти(СокрЛП(ИмяОт)," "))); /// Находим Имя 
Отчество=СОкрЛП(Сред(ФИОСлитно,(СтрДлина(СокрЛП(Фамилия))+СтрДлина(СокрЛП(Имя))+2),(СтрДлина(ФИОСлитно)-СтрДлина(СокрЛП(Фамилия))-СтрДлина(СокрЛП(Имя))-1))); //ну и Отчество
Возврат ?(НЕ ПустаяСтрока(Фамилия), 
Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""), 
"");
КонецФункции

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма;