// Нажатие кнопки "Домашняя страница" (домик)
Процедура КоманднаяПанельФормыКнопкаНаСтраничкуАвтора(Кнопка)
	ЗапуститьПриложение("http://azernot.narod.ru");
КонецПроцедуры

Процедура ДействияФормыОткрыватьНастройки(Кнопка)
	ОткрыватьФормуНастроек = Не ОткрыватьФормуНастроек;
	УправлениеПометкамиКнопокКоманднойПанели();
КонецПроцедуры

Процедура НазначениеИспользованияНачалоВыбора(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(СписокНазначенийИспользования) Тогда
		ВыбНазначение = Неопределено;
		ВыбНазначение = СписокНазначенийИспользования.ВыбратьЭлемент("Выберите назначение использования:",ВыбНазначение);
		Если НЕ ВыбНазначение =  Неопределено ТОгда
			НазначениеИспользования = ВыбНазначение.Значение;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура КомиссияЧленКомиссииНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Значение = "";
	ФормаВыбора = Справочники.ФизическиеЛица.ПолучитьФормуВыбора(,ЭтаФорма);
	Значение = ФормаВыбора.ОткрытьМодально();
	Если ЗначениеЗаполнено(Значение) Тогда
		ИмяДолжность = мДанныеФизЛица(Значение, ?(Не ЗначениеЗаполнено(СсылкаНаОбъект),Справочники.Организации.ПустаяСсылка(),СсылкаНаОбъект.Организация), ?(Не ЗначениеЗаполнено(СсылкаНаОбъект),ТекущаяДата(), СсылкаНаОбъект.Дата));
		Элемент.Значение = ИмяДолжность.ФамилияИО;
		ЭлементыФормы.Комиссия.ТекущиеДанные.ДолжностьЧленКомиссии = ИмяДолжность.Должность;
	КонецЕсли;	
КонецПроцедуры

Процедура КомиссияЧленКомиссииОчистка(Элемент, СтандартнаяОбработка)
		ЭлементыФормы.Комиссия.ТекущиеДанные.ДолжностьЧленКомиссии = "";
КонецПроцедуры

Процедура ГлавныйБухгалтерПриИзменении(Элемент)
	ДоступностьКомиссии();
КонецПроцедуры

Процедура НазначениеИспользованияИзКомментарияПриИзменении(Элемент)
	ДоступностьКомиссии()
КонецПроцедуры

// Управляет пометками кнопок ком. панели
//
// Параметры:
//	Нет.
//
Процедура УправлениеПометкамиКнопокКоманднойПанели()
	ЭлементыФормы.ДействияФормы.Кнопки.ОткрыватьНастройки.Пометка = ОткрыватьФормуНастроек;
	ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.ОткрыватьНастройки.Пометка = ОткрыватьФормуНастроек;
	
КонецПроцедуры // УправлениеПометкамиКнопокКоманднойПанели()

Процедура ДоступностьКомиссии()
	Если СписаниеПодтверждает = 2 Тогда
		ДоступностьКомисии = Истина;
	Иначе
		ДоступностьКомисии = Ложь;
	КонецЕсли;
	
	ЭлементыФормы.РамкаКомиссия.Доступность = ДоступностьКомисии;
	ЭлементыФормы.Комиссия.Доступность = ДоступностьКомисии;
	ЭлементыФормы.КоманднаяПанельКомиссия.Доступность = ДоступностьКомисии;
	
	ЭлементыФормы.НазначениеИспользования.Доступность = Не НазначениеИспользованияИзКомментария;
	
КонецПроцедуры

Процедура ПриОткрытии()
	ДоступностьКомиссии();
	УправлениеПометкамиКнопокКоманднойПанели();
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	СохранитьЗначение("ОткрыватьФормуНастроек", ОткрыватьФормуНастроек);
	СохранитьЗначение("АктТМЦКомиссия", СписаниеПодтверждает);
	СохранитьЗначение("АктТМЦСоставКомиссии", Комиссия.Выгрузить());
	СохранитьЗначение("АктТМЦИзКомментария", НазначениеИспользованияИзКомментария);
	
	// попытаемся найти подстроку в списке
	Поз	= СписокНазначенийИспользования.НайтиПоЗначению(НазначениеИспользования);
	Если НЕ Поз = Неопределено Тогда
		// сместим значение в начало списка
		СписокНазначенийИспользования.Сдвинуть(Поз, -СписокНазначенийИспользования.Индекс(Поз));
	Иначе
		// добавим подстроку в начало списока
		СписокНазначенийИспользования.Вставить(0, НазначениеИспользования);
		Пока СписокНазначенийИспользования.Количество() > 15 Цикл
			СписокНазначенийИспользования.Удалить(15);
		КонецЦикла;
	КонецЕсли;  
	
	СохранитьЗначение("АктТМЦСписокНазначений", СписокНазначенийИспользования);
	Если МодальныйРежим Тогда
		ОповеститьОВыборе(Истина);
	Иначе
		Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Предупреждение("Не указан документ-основание!");
			Возврат;
		КонецЕсли;
		ОткрыватьФормуНастроек = Ложь;
		ТабличныйДокумент = Печать();
    	ТабличныйДокумент.Показать("Акт списания ТМЦ");
	КонецЕсли;
КонецПроцедуры


