   	Запрос = Новый Запрос;
	
	
	Запросы = "
	|ВЫБРАТЬ
	|	Хозрасчетный.Регистратор
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор ССЫЛКА Документ.ОперацияБух
	|	И Хозрасчетный.СчетДт = &СчетДт
	|	И Хозрасчетный.СчетКт = &СчетКт
	|	И Хозрасчетный.Активность = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.Регистратор
	|";
	
	Запрос.УстановитьПараметр("СчетДт", ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымДоходам);
	Запрос.УстановитьПараметр("СчетКт", ПланыСчетов.Хозрасчетный.ПроцентыПолученные);
	
	Запрос.Текст = Запросы;
	РЗ = Запрос.Выполнить().Выбрать();

Пока РЗ.Следующий() Цикл
   НаборЗаписейБУ = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
   НаборЗаписейБУ.Отбор.Регистратор.Использование = Истина;
   НаборЗаписейБУ.Отбор.Регистратор.Значение  = РЗ.Регистратор;
   НаборЗаписейБУ.Прочитать();
   Для Каждого ЗаписьБУ Из НаборЗаписейБУ Цикл
      Если (ЗаписьБУ.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымДоходам) и
          (ЗаписьБУ.СчетКт = ПланыСчетов.Хозрасчетный.ПроцентыПолученные) Тогда
        ЗаписьБУ.СчетКт = ПланыСчетов.Хозрасчетный.ДоходОтРеализацииРаботИУслуг;
		БухгалтерскийУчет.УстановитьСубконто(ЗаписьБУ.СчетКт, ЗаписьБУ.СубконтоКт, "СтатьиДоходов", Справочники.СтатьиДоходов.НПНК_ДО_ );
        ЕстьИзменения = Истина;
      КонецЕсли;
   КонецЦикла;
   Если ЕстьИзменения Тогда
      НаборЗаписейБУ.Записать();
	 Сообщить("Проводки в " + РЗ.Регистратор + " изменены ", СтатусСообщения.Информация);
  КонецЕсли; 
//ОбработкаПрерыванияПользователя();
КонецЦикла;		
