
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт3 как Договор,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 Как Контрагент
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , , , ) КАК ХозрасчетныйДвиженияССубконто
	|ГДЕ
	|	ХозрасчетныйДвиженияССубконто.Регистратор.Содержание ПОДОБНО &Содержание
	|";
	
	
	Запрос.УстановитьПараметр("Содержание", "Купівля заборгованості згідно договору факторингу");
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

            СтруктураСвойства = Новый Структура;
            СтруктураСвойства.Вставить("Свойство","Поставщик");
            СтруктураСвойства.Вставить("Значение",Выборка.Контрагент);
            ЗаписатьЗначенияСвойствА(Выборка.Договор,СтруктураСвойства);

	КонецЦикла;
	
	
КонецПроцедуры

Функция ЗаписатьЗначенияСвойствА(Объект,СтруктураСвойства)    
    НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
    Если ЗначениеЗаполнено(СтруктураСвойства.Значение) Тогда
        Запись = НаборЗаписейЗначенияСвойств.Добавить();
        Запись.Объект   = Объект.Ссылка;
        Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СтруктураСвойства.Свойство);
        Запись.Свойство = Свойство.Ссылка;
        Запись.Значение = СтруктураСвойства.Значение;
    КонецЕсли;
    
    НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Объект.Ссылка);
    НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(Свойство); //.Ссылка
    Попытка
        НаборЗаписейЗначенияСвойств.Записать();
    Исключение
            Предупреждение("Не удалось записать значения свойств:" + Символы.ПС + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
    Возврат Истина;    
КонецФункции
