
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
//	Организация = ОбщегоНазначения.ГоловнаяОрганизация(глЗначениеПеременной("ОсновнаяОрганизация"));
	
	Запрос = Новый Запрос;
	
	Запросы = "
	|ВЫБРАТЬ
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт2,
	|	ХозрасчетныйДвиженияССубконто.Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК ХозрасчетныйДвиженияССубконто
	|ГДЕ
	|	ХозрасчетныйДвиженияССубконто.Регистратор В (ВЫБРАТЬ
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = &СтатьяДвиженияДенежныхСредств
	|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СчетУчетаРасчетовСКонтрагентом = &СчетУчетаРасчетовСКонтрагентом)
	|";
	

	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", СчетУчетаРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
	
	Запрос.Текст = Запросы;
	РЗ = Запрос.Выполнить().Выгрузить();
	//НачатьТранзакцию();
	
			ДокОперация = Документы.ОперацияБух.СоздатьДокумент();
			ДокОперация.Дата =  НачалоДня(Дата)+4*60*60;  
			ДокОперация.Организация = Организация;
			ДокОперация.Ответственный = ТекПользователь;
			ДокОперация.Содержание = "Корректировка 6851";
			ДокОперация.Комментарий = "Корректировка 6851";
			ДокОперация.Записать();
			Операция = ДокОперация.Ссылка;
			РегХозрасчетныйНачислениеПроцентов = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			РегХозрасчетныйНачислениеПроцентов.Отбор.Регистратор.Значение = Операция;
			
	Для Каждого Строка Из РЗ Цикл
		
		РегЗапись = РегХозрасчетныйНачислениеПроцентов.Добавить();
		РегЗапись.Период = Дата;
		РегЗапись.Регистратор = Операция;
		РегЗапись.Организация = Организация;
		РегЗапись.Содержание  = "Корректировка";
		
		РегЗапись.СчетДт = СчетУчетаРасчетовСКонтрагентом;
		РегЗапись.СчетКт =СчетУчетаРасчетовСКонтрагентом;
		
		ОбщегоНазначения.УстановитьСубконто(РегЗапись.СчетКт, РегЗапись.СубконтоКт, "Контрагенты", Контрагент );
		ОбщегоНазначения.УстановитьСубконто(РегЗапись.СчетКт, РегЗапись.СубконтоКт, "Договоры", Договор);
		
		ОбщегоНазначения.УстановитьСубконто(РегЗапись.СчетДт, РегЗапись.СубконтоДт, "Контрагенты", Строка.СубконтоКт1);
		ОбщегоНазначения.УстановитьСубконто(РегЗапись.СчетДт, РегЗапись.СубконтоДт, "Договоры", Строка.СубконтоКт2);
		
		РегЗапись.Сумма = Строка.Сумма;
		РегХозрасчетныйНачислениеПроцентов.Записать();
		Опер = Операция.ПолучитьОбъект();
		Опер.СуммаОперации = Опер.СуммаОперации + РегЗапись.Сумма;
		Опер.Записать();


	КонецЦикла;	
	
	//ЗафиксироватьТранзакцию(); 

	
КонецПроцедуры

